app/controllers/links_controller.rb

  def index
    @links = apply_scopes(Link).order('created_at DESC')
    @links = @links.where(:id => Link.by_seller(params[:seller])) if params[:seller].present?
    @links = @links.where(:id => Link.by_payment_method(params[:payment_method])) if params[:payment_method].present?
---
SELECT `payments`.* FROM `payments` WHERE `payments`.`link_id` = 1 ORDER BY `payments`.`id` DESC LIMIT 1

  def show
    @link = Link.find params[:id]
---
SELECT "links".* FROM "links" WHERE "links"."id" = $1 LIMIT 1  [["id", "1"]]

  def edit
    @link = Link.find params[:id]
---
SELECT "links".* FROM "links" WHERE "links"."id" = $1 LIMIT 1  [["id", "2"]]

  def create
    @link = Link.new params[:link]
    @link.user_id = current_user.id
    if @link.save
---
INSERT INTO `links` (`created_at`, `keyword`, `name`, `page_rank`, `placement`, `updated_at`, `url`, `user_id`) VALUES ('2012-02-25 19:37:27', 'pandas', 'CfA', 2, '', '2012-02-25 19:37:27', 'http://codeforamerica.org', 1)

  def destroy
    @link = Link.find params[:id]
    @link.destroy
---
SELECT `links`.* FROM `links` WHERE `links`.`id` = 3 LIMIT 1
DELETE FROM `links` WHERE `links`.`id` = 3